[
  {
      "id": "0",
      "title": "นักพัฒนา Full Stack",
      "company": "Reach Creative",
      "description": "ในตำแหน่งปัจจุบันของฉัน ฉันเชี่ยวชาญในการพัฒนาส่วนประกอบและหน้าเว็บสำหรับแอปพลิเคชัน Next.js ที่ทันสมัย ฉันใช้แพลตฟอร์ม CMS ที่ซับซ้อน รวมถึง Prismic และ Sanity เพื่อยกระดับโครงการพัฒนาเว็บให้มีความโดดเด่นและมีเนื้อหาที่หลากหลาย บทบาทของฉันรวมถึงการทำงานร่วมกับทีมออกแบบอย่างใกล้ชิด โดยมุ่งเน้นไปที่การบูรณาการแนวคิดทางภาพเข้ากับฟังก์ชันการทำงานของเว็บอย่างราบรื่น การทำงานร่วมกันระหว่างการออกแบบและการพัฒนานี้รับประกันว่าผลิตภัณฑ์สุดท้ายไม่เพียงแค่ตรงตามความคาดหวังของผู้ใช้เท่านั้น แต่ยังเกินความคาดหวังนั้น ๆ เพื่อให้ประสบการณ์การใช้งานที่เป็นมิตรและมีส่วนร่วม",
      "timePeriod": "มกราคม 2024 - ปัจจุบัน",
      "img": "images/reach.jpg"
  },
  {
      "id": "1",
      "title": "นักพัฒนาซอฟต์แวร์ระดับ Junior",
      "company": "IBG Software",
      "description": "ที่ IBG Software ฉันนำการพัฒนาแบบ Full-stack ในสภาพแวดล้อมแบบ Agile โดยมุ่งเน้นที่แอปพลิเคชัน React และ React Native ที่ใช้ TypeScript, Node.js และ Express.js งานของฉันช่วยเพิ่มประสิทธิภาพและการดำเนินการของโครงการอย่างมีนัยสำคัญ การใช้ MongoDB และ Firebase Firestore อย่างมีกลยุทธ์ของฉันได้เพิ่มประสิทธิภาพของระบบหลังบ้าน ฉันได้ปรับปรุงประสบการณ์ของผู้ใช้โดยการบูรณาการ Firebase Authentication กับ Redux Saga ซึ่งช่วยปรับปรุงทั้งความปลอดภัยและการใช้งาน ผ่าน Cypress ฉันได้พัฒนาโปรโตคอลการทดสอบแบบ end-to-end เพื่อให้มั่นใจในคุณภาพของซอฟต์แวร์ ฉันได้พัฒนา RESTful APIs ที่สามารถปรับขนาดได้เพื่อปรับปรุงประสิทธิภาพของระบบและบันทึกกระบวนการอย่างละเอียดใน Confluence เพื่อเพิ่มความร่วมมือในทีม การมีส่วนร่วมกับผู้มีส่วนได้ส่วนเสียช่วยให้ผลิตภัณฑ์สอดคล้องกับวัตถุประสงค์ทางธุรกิจและเพิ่มความพึงพอใจ การจัดการงานโครงการผ่าน Jira ของฉันช่วยส่งเสริมความร่วมมือและรับประกันการเสร็จสิ้นตามกำหนด",
      "timePeriod": "พฤศจิกายน 2022 - มกราคม 2024",
      "img": "images/ibg.png"
  },
  {
      "id": "2",
      "title": "นักพัฒนาซอฟต์แวร์",
      "company": "Chingu",
      "description": "ใน Voyage 41 ของ Chingu ทีมของเราพัฒนาแอปพลิเคชันการวางแผนการเดินทางที่เน้นความสามารถในการเข้าถึง ในช่วงสัปดาห์แยกต่างหาก คู่หูของฉันและฉันได้สร้างแอปพลิเคชัน Pomodoro Clock ซึ่งช่วยเพิ่มความร่วมมือ การจัดการเวลา และทักษะ React ผ่านวิธีการ Agile",
      "timePeriod": "ตุลาคม 2022 - พฤศจิกายน 2022 & มีนาคม 2023",
      "img": "images/chingu.png"
  }
]
