[
    {
      "id": "1",
      "title": "Git Me There",
      "description": "Git Me There is a user-friendly web application, crafted using HTML, CSS, JavaScript, and leveraging the power of third-party APIs. This application serves as a one-stop solution for planning transportation logistics for upcoming journeys within any U.S. city. By entering their destination, users are provided with walking and biking scores, as well as a list of nearby restaurants. For destinations with a walking score below 50, the application conveniently presents an option to book an Uber ride, ensuring an effortless travel experience.",
      "thumbnail": "projects/git_me_there.png",
      "deployed": "https://missatrox44.github.io/git-me-there",
      "date": "July 2022"
    },
    {
      "id": "2",
      "title": "React-pokemon-api",
      "description": "Fact or Fiction is a dynamic full-stack application offering users an engaging gaming experience. The game involves discerning whether given laws or headlines are authentic or fabricated. Developed using Handlebars.js, Express.js, and Sequelize, the project employs Bootstrap for styling, ensuring a sleek and intuitive user interface.",
      "thumbnail": "projects/pokemon.png",
      "deployed": "https://rungkoko.github.io/pokemon/",
      "date": "August 2022"
    },
    {
      "id": "3",
      "title": "One wheel hoverboard",
      "description": "Baes is a comprehensive application built on the MERN stack, designed with the aim of enhancing personal relationships. It enables users to maintain and manage crucial information about their significant contacts. With Baes, users can set up an account, modify their profiles, forge connections, and record customized notes about their interactions and relationships.",
      "thumbnail": "projects/onewheel.png",
      "deployed": "https://loversnotfighters.vercel.app/",
      "date": "September 2022"
    },
    {
      "id": "4",
      "title": "Wordpress-LineOA-Botnoi",
      "description": "A meticulously designed digital showcase of my diverse projects and technical prowess. Crafted using Bootstrap, this portfolio captures the essence of responsiveness and modern design aesthetics. It presents my works in an organized, elegant manner, ensuring smooth navigation and optimal viewing across all device sizes. From the intricate animations to the intuitive layouts, every aspect of this portfolio is a testament to my commitment to quality and attention to detail.",
      "thumbnail": "projects/Wordpress-line.png",
      "deployed": "https://missatrox44.github.io/portfolio/",
      "date": "September 2022"
    },
    {
      "id": "5",
      "title": "Bmi-Calculator",
      "description": "This project involved a comprehensive refactoring of the Odessa High School Broncho Band's website. It was redesigned to be mobile responsive, while also updating images and links for a more appealing and user-friendly experience. New pages were added, working in close collaboration with the band director to ensure that the final design echoed her vision and faithfully represented the values of the OHS Broncho Band. The website was expertly crafted using tools from WiX and continues to be a work in progress, reflecting the ever-evolving spirit of the band program.",
      "thumbnail": "projects/BMI.png",
      "deployed": "http://bmi-calculator-child.infinityfreeapp.com/",
      "date": "October 2022"
    }
  ]